betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_dal_uart.h
/** @defgroup UART_Stop_Bits UART Number of Stop Bits
  * @{
  */
#define UART_STOPBITS_1                     0x00000000U
#define UART_STOPBITS_2                     ((uint32_t)USART_CTRL2_STOPCFG_1)
/**
  * @}
  */

/** @defgroup UART_Parity UART Parity
  * @{
  */
#define UART_PARITY_NONE                    0x00000000U
#define UART_PARITY_EVEN                    ((uint32_t)USART_CTRL1_PCEN)
#define UART_PARITY_ODD                     ((uint32_t)(USART_CTRL1_PCEN | USART_CTRL1_PCFG))
/**
  * @}
  */

/** @defgroup UART_Hardware_Flow_Control UART Hardware Flow Control
  * @{
  */
#define UART_HWCONTROL_NONE                  0x00000000U
#define UART_HWCONTROL_RTS                   ((uint32_t)USART_CTRL3_RTSEN)
#define UART_HWCONTROL_CTS                   ((uint32_t)USART_CTRL3_CTSEN)
#define UART_HWCONTROL_RTS_CTS               ((uint32_t)(USART_CTRL3_RTSEN | USART_CTRL3_CTSEN))
/**
  * @}
  */

/** @defgroup UART_Mode UART Transfer Mode
  * @{
  */
#define UART_MODE_RX                        ((uint32_t)USART_CTRL1_RXEN)
#define UART_MODE_TX                        ((uint32_t)USART_CTRL1_TXEN)
#define UART_MODE_TX_RX                     ((uint32_t)(USART_CTRL1_TXEN | USART_CTRL1_RXEN))
/**
  * @}
  */

/** @defgroup UART_State UART State
  * @{
  */
#define UART_STATE_DISABLE                  0x00000000U
#define UART_STATE_ENABLE                   ((uint32_t)USART_CTRL1_UEN)
/**
  * @}
  */

/** @defgroup UART_Over_Sampling UART Over Sampling
  * @{
  */
#define UART_OVERSAMPLING_16                    0x00000000U
#define UART_OVERSAMPLING_8                     ((uint32_t)USART_CTRL1_OSMCFG)
/**
  * @}
  */

/** @defgroup UART_LIN_Break_Detection_Length  UART LIN Break Detection Length
  * @{
  */
#define UART_LINBREAKDETECTLENGTH_10B      0x00000000U
#define UART_LINBREAKDETECTLENGTH_11B      ((uint32_t)USART_CTRL2_LBDLCFG)
/**
  * @}
  */

/** @defgroup UART_WakeUp_functions  UART Wakeup Functions
  * @{
  */
#define UART_WAKEUPMETHOD_IDLELINE                0x00000000U
#define UART_WAKEUPMETHOD_ADDRESSMARK             ((uint32_t)USART_CTRL1_WUPMCFG)
/**
  * @}
  */

/** @defgroup UART_Flags   UART FLags
  *        Elements values convention: 0xXXXX
  *           - 0xXXXX  : Flag mask in the SR register
  * @{
  */
#define UART_FLAG_CTS                       ((uint32_t)USART_STS_CTSFLG)
#define UART_FLAG_LBD                       ((uint32_t)USART_STS_LBDFLG)
#define UART_FLAG_TXE                       ((uint32_t)USART_STS_TXBEFLG)
#define UART_FLAG_TC                        ((uint32_t)USART_STS_TXCFLG)
#define UART_FLAG_RXNE                      ((uint32_t)USART_STS_RXBNEFLG)
#define UART_FLAG_IDLE                      ((uint32_t)USART_STS_IDLEFLG)
#define UART_FLAG_ORE                       ((uint32_t)USART_STS_OVREFLG)
#define UART_FLAG_NE                        ((uint32_t)USART_STS_NEFLG)
#define UART_FLAG_FE                        ((uint32_t)USART_STS_FEFLG)
#define UART_FLAG_PE                        ((uint32_t)USART_STS_PEFLG)
/**
  * @}
  */

/** @defgroup UART_Interrupt_definition  UART Interrupt Definitions
  *        Elements values convention: 0xY000XXXX
  *           - XXXX  : Interrupt mask (16 bits) in the Y register
  *           - Y  : Interrupt source register (2bits)
  *                   - 0001: CTRL1 register
  *                   - 0010: CTRL2 register
  *                   - 0011: CTRL3 register
  * @{
  */

#define UART_IT_PE                       ((uint32_t)(UART_CTRL1_REG_INDEX << 28U | USART_CTRL1_PEIEN))
#define UART_IT_TXE                      ((uint32_t)(UART_CTRL1_REG_INDEX << 28U | USART_CTRL1_TXBEIEN))
#define UART_IT_TC                       ((uint32_t)(UART_CTRL1_REG_INDEX << 28U | USART_CTRL1_TXCIEN))
#define UART_IT_RXNE                     ((uint32_t)(UART_CTRL1_REG_INDEX << 28U | USART_CTRL1_RXBNEIEN))
#define UART_IT_IDLE                     ((uint32_t)(UART_CTRL1_REG_INDEX << 28U | USART_CTRL1_IDLEIEN))

#define UART_IT_LBD                      ((uint32_t)(UART_CTRL2_REG_INDEX << 28U | USART_CTRL2_LBDIEN))

#define UART_IT_CTS                      ((uint32_t)(UART_CTRL3_REG_INDEX << 28U | USART_CTRL3_CTSIEN))
#define UART_IT_ERR                      ((uint32_t)(UART_CTRL3_REG_INDEX << 28U | USART_CTRL3_ERRIEN))
/**
  * @}
  */

/** @defgroup UART_RECEPTION_TYPE_Values  UART Reception type values
  * @{
  */
#define DAL_UART_RECEPTION_STANDARD          (0x00000000U)             /*!< Standard reception                       */
#define DAL_UART_RECEPTION_TOIDLE            (0x00000001U)             /*!< Reception till completion or IDLE event  */
/**
  * @}
  */

/** @defgroup UART_RxEvent_Type_Values  UART RxEvent type values
  * @{
  */
#define DAL_UART_RXEVENT_TC                  (0x00000000U)             /*!< RxEvent linked to Transfer Complete event */
#define DAL_UART_RXEVENT_HT                  (0x00000001U)             /*!< RxEvent linked to Half Transfer event     */
#define DAL_UART_RXEVENT_IDLE                (0x00000002U)
/**
  * @}
  */

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup UART_Exported_Macros UART Exported Macros
  * @{
  */

/** @brief Reset UART handle gstate & RxState
  * @param  __HANDLE__ specifies the UART Handle.
  *         UART Handle selects the USARTx or UARTy peripheral
  *         (USART,UART availability and x,y values depending on device).
  * @retval None
  */
#if (USE_DAL_UART_REGISTER_CALLBACKS == 1)
#define __DAL_UART_RESET_HANDLE_STATE(__HANDLE__)  do{                                                   \
                                                       (__HANDLE__)->gState = DAL_UART_STATE_RESET;      \
                                                       (__HANDLE__)->RxState = DAL_UART_STATE_RESET;     \
                                                       (__HANDLE__)->MspInitCallback = NULL;             \
                                                       (__HANDLE__)->MspDeInitCallback = NULL;           \
                                                     } while(0U)
#else
#define __DAL_UART_RESET_HANDLE_STATE(__HANDLE__)  do{                                                   \
                                                       (__HANDLE__)->gState = DAL_UART_STATE_RESET;      \
                                                       (__HANDLE__)->RxState = DAL_UART_STATE_RESET;     \
                                                     } while(0U)
#endif /*USE_DAL_UART_REGISTER_CALLBACKS */

/** @brief  Flushes the UART DATA register
  * @param  __HANDLE__ specifies the UART Handle.
  *         UART Handle selects the USARTx or UARTy peripheral
  *         (USART,UART availability and x,y values depending on device).
  */
#define __DAL_UART_FLUSH_DRREGISTER(__HANDLE__) ((__HANDLE__)->Instance->DATA)

